Revit 2027 API
VoltageType.SetVoltageValue Method
 Assign new values to modify voltage type, all of the unit are volt.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetVoltageValue(
	double actualValue,
	double minValue,
	double maxValue
)
Public Sub SetVoltageValue (
	actualValue As Double,
	minValue As Double,
	maxValue As Double
)
public:
void SetVoltageValue(
	double actualValue,
	double minValue,
	double maxValue
)
member SetVoltageValue :
        actualValue : float *
        minValue : float *
        maxValue : float -> unit
Parameters
actualValue Double
minValue Double
maxValue Double
Exceptions
Exception | Condition
ArgumentException |  Actual value can't be more than minValue or less than maxValue, and all of them can't be negative, otherwise the exception will be thrown.
See Also
Reference
VoltageType Class
Autodesk.Revit.DB.Electrical Namespace